#pragma GCC diagnostic push
/**
 * This file was automatically generated by nk-gen-c.
 * The following copyright applies to the portions of nk-gen-c located in this file:
 * (C) 2024 AO Kaspersky Lab. All Rights Reserved.
 */

#include <nk/transport.h>
#include <nk/types.h>
#include <nk/layout.h>
#ifndef __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
#define __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
nk_static_assert(__NK_SIZEOF_NK_HANDLE_DESC_T == 16, __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
nk_static_assert(__NK_ALIGNOF_NK_HANDLE_DESC_T == 8, __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
#define __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
nk_static_assert(__NK_SIZEOF_NK_PTR_T == 8, __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
#define __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
nk_static_assert(__NK_ALIGNOF_NK_PTR_T == 4, __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
#define __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
nk_static_assert(__NK_SIZEOF_NK_MESSAGE == 24, __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
nk_static_assert(__NK_ALIGNOF_NK_MESSAGE == 8, __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
#define __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
nk_static_assert(__NK_MESSAGE_SIZE_MAX == 8388607, __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
#define __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
nk_static_assert(__NK_MESSAGE_HANDLES_MAX == 255, __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255_FAIL);
#endif
#ifndef __NK_ASSERT___NK_IID_MAX_IS_65535
#define __NK_ASSERT___NK_IID_MAX_IS_65535
nk_static_assert(__NK_IID_MAX == 65535, __NK_ASSERT___NK_IID_MAX_IS_65535_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MID_MAX_IS_65535
#define __NK_ASSERT___NK_MID_MAX_IS_65535
nk_static_assert(__NK_MID_MAX == 65535, __NK_ASSERT___NK_MID_MAX_IS_65535_FAIL);
#endif

#ifndef __NK_GEN_CPP_MANGLE
#  ifdef __cplusplus
#    define __NK_GEN_CPP_MANGLE(name) name ## _
#  else
#    define __NK_GEN_CPP_MANGLE(name) name
#  endif
#endif

#ifdef __cplusplus
    extern "C" {
#endif

#ifndef ____nk_ptr_t__NKTYPE__
#define ____nk_ptr_t__NKTYPE__
nk_static_assert(sizeof(nk_ptr_t) == 8, bad_nk_ptr_t_size);
nk_static_assert(nk_alignof(nk_ptr_t) == 4, bad_nk_ptr_t_align);

#endif /* ____nk_ptr_t__NKTYPE__ */

#ifndef ____SInt32__RAWTYPE__
#define ____SInt32__RAWTYPE__
nk_static_assert(sizeof(nk_sint32_t) == 4, bad_nk_sint32_t_size);
nk_static_assert(nk_alignof(nk_sint32_t) == 4, bad_nk_sint32_t_align);

#endif /* ____SInt32__RAWTYPE__ */

#ifndef ____UInt32__RAWTYPE__
#define ____UInt32__RAWTYPE__
nk_static_assert(sizeof(nk_uint32_t) == 4, bad_nk_uint32_t_size);
nk_static_assert(nk_alignof(nk_uint32_t) == 4, bad_nk_uint32_t_align);

#endif /* ____UInt32__RAWTYPE__ */

#ifndef ____UInt8__RAWTYPE__
#define ____UInt8__RAWTYPE__
nk_static_assert(sizeof(nk_uint8_t) == 1, bad_nk_uint8_t_size);
nk_static_assert(nk_alignof(nk_uint8_t) == 1, bad_nk_uint8_t_align);

#endif /* ____UInt8__RAWTYPE__ */

#ifndef __drone_controller__AutopilotConnectorInterface__INTERFACE__
#define __drone_controller__AutopilotConnectorInterface__INTERFACE__
enum {
    drone_controller_AutopilotConnectorInterface_WaitForArmRequest_mid,
    drone_controller_AutopilotConnectorInterface_PermitArm_mid,
    drone_controller_AutopilotConnectorInterface_ForbidArm_mid,
    drone_controller_AutopilotConnectorInterface_PauseFlight_mid,
    drone_controller_AutopilotConnectorInterface_ResumeFlight_mid,
    drone_controller_AutopilotConnectorInterface_AbortMission_mid,
    drone_controller_AutopilotConnectorInterface_ChangeSpeed_mid,
    drone_controller_AutopilotConnectorInterface_ChangeAltitude_mid,
    drone_controller_AutopilotConnectorInterface_ChangeWaypoint_mid,
    drone_controller_AutopilotConnectorInterface_SetMission_mid,
    drone_controller_AutopilotConnectorInterface_mid_max,
};
enum {
    drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_WaitForArmRequest_err_handles =
    0,
    drone_controller_AutopilotConnectorInterface_PermitArm_req_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_PermitArm_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_PermitArm_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_PermitArm_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_PermitArm_err_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ForbidArm_req_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_ForbidArm_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_ForbidArm_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ForbidArm_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ForbidArm_err_handles =
    0,
    drone_controller_AutopilotConnectorInterface_PauseFlight_req_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_PauseFlight_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_PauseFlight_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_PauseFlight_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_PauseFlight_err_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ResumeFlight_req_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_ResumeFlight_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_ResumeFlight_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ResumeFlight_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ResumeFlight_err_handles =
    0,
    drone_controller_AutopilotConnectorInterface_AbortMission_req_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_AbortMission_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_AbortMission_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_AbortMission_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_AbortMission_err_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeSpeed_req_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeSpeed_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeSpeed_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeSpeed_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeSpeed_err_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeAltitude_req_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeAltitude_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeAltitude_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeAltitude_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeAltitude_err_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_ChangeWaypoint_err_handles =
    0,
    drone_controller_AutopilotConnectorInterface_SetMission_req_mission_size =
    1024,
    drone_controller_AutopilotConnectorInterface_SetMission_req_arena_size =
    1024,
    drone_controller_AutopilotConnectorInterface_SetMission_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_SetMission_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_SetMission_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_SetMission_err_handles =
    0,
    drone_controller_AutopilotConnectorInterface_req_arena_size =
    1024,
    drone_controller_AutopilotConnectorInterface_res_arena_size =
    0,
    drone_controller_AutopilotConnectorInterface_req_handles =
    0,
    drone_controller_AutopilotConnectorInterface_res_handles =
    0,
    drone_controller_AutopilotConnectorInterface_err_handles =
    0,
};
typedef struct __nk_packed drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req) == 24, bad_drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req_base__offset);
#pragma pack(push, 8) /* drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res */
typedef struct drone_controller_AutopilotConnectorInterface_WaitForArmRequest_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_WaitForArmRequest_err;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_WaitForArmRequest_err) == 24, bad_drone_controller_AutopilotConnectorInterface_WaitForArmRequest_err_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_WaitForArmRequest_err, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_WaitForArmRequest_err_base__offset);
typedef struct drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_AutopilotConnectorInterface_WaitForArmRequest_err err_;
            };
        }
drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res) == 32, bad_drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res, success) == 24, bad_drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res_success_offset);
#pragma pack(pop) /* drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res */
typedef struct __nk_packed drone_controller_AutopilotConnectorInterface_PermitArm_req {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_PermitArm_req;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_PermitArm_req) == 24, bad_drone_controller_AutopilotConnectorInterface_PermitArm_req_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_PermitArm_req, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_PermitArm_req_base__offset);
#pragma pack(push, 8) /* drone_controller_AutopilotConnectorInterface_PermitArm_res */
typedef struct drone_controller_AutopilotConnectorInterface_PermitArm_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_PermitArm_err;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_PermitArm_err) == 24, bad_drone_controller_AutopilotConnectorInterface_PermitArm_err_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_PermitArm_err, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_PermitArm_err_base__offset);
typedef struct drone_controller_AutopilotConnectorInterface_PermitArm_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_AutopilotConnectorInterface_PermitArm_err err_;
            };
        }
drone_controller_AutopilotConnectorInterface_PermitArm_res;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_PermitArm_res) == 32, bad_drone_controller_AutopilotConnectorInterface_PermitArm_res_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_PermitArm_res, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_PermitArm_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_PermitArm_res, success) == 24, bad_drone_controller_AutopilotConnectorInterface_PermitArm_res_success_offset);
#pragma pack(pop) /* drone_controller_AutopilotConnectorInterface_PermitArm_res */
typedef struct __nk_packed drone_controller_AutopilotConnectorInterface_ForbidArm_req {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_ForbidArm_req;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ForbidArm_req) == 24, bad_drone_controller_AutopilotConnectorInterface_ForbidArm_req_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ForbidArm_req, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ForbidArm_req_base__offset);
#pragma pack(push, 8) /* drone_controller_AutopilotConnectorInterface_ForbidArm_res */
typedef struct drone_controller_AutopilotConnectorInterface_ForbidArm_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_ForbidArm_err;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ForbidArm_err) == 24, bad_drone_controller_AutopilotConnectorInterface_ForbidArm_err_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ForbidArm_err, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ForbidArm_err_base__offset);
typedef struct drone_controller_AutopilotConnectorInterface_ForbidArm_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_AutopilotConnectorInterface_ForbidArm_err err_;
            };
        }
drone_controller_AutopilotConnectorInterface_ForbidArm_res;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ForbidArm_res) == 32, bad_drone_controller_AutopilotConnectorInterface_ForbidArm_res_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ForbidArm_res, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ForbidArm_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ForbidArm_res, success) == 24, bad_drone_controller_AutopilotConnectorInterface_ForbidArm_res_success_offset);
#pragma pack(pop) /* drone_controller_AutopilotConnectorInterface_ForbidArm_res */
typedef struct __nk_packed drone_controller_AutopilotConnectorInterface_PauseFlight_req {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_PauseFlight_req;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_PauseFlight_req) == 24, bad_drone_controller_AutopilotConnectorInterface_PauseFlight_req_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_PauseFlight_req, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_PauseFlight_req_base__offset);
#pragma pack(push, 8) /* drone_controller_AutopilotConnectorInterface_PauseFlight_res */
typedef struct drone_controller_AutopilotConnectorInterface_PauseFlight_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_PauseFlight_err;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_PauseFlight_err) == 24, bad_drone_controller_AutopilotConnectorInterface_PauseFlight_err_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_PauseFlight_err, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_PauseFlight_err_base__offset);
typedef struct drone_controller_AutopilotConnectorInterface_PauseFlight_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_AutopilotConnectorInterface_PauseFlight_err err_;
            };
        }
drone_controller_AutopilotConnectorInterface_PauseFlight_res;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_PauseFlight_res) == 32, bad_drone_controller_AutopilotConnectorInterface_PauseFlight_res_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_PauseFlight_res, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_PauseFlight_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_PauseFlight_res, success) == 24, bad_drone_controller_AutopilotConnectorInterface_PauseFlight_res_success_offset);
#pragma pack(pop) /* drone_controller_AutopilotConnectorInterface_PauseFlight_res */
typedef struct __nk_packed drone_controller_AutopilotConnectorInterface_ResumeFlight_req {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_ResumeFlight_req;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ResumeFlight_req) == 24, bad_drone_controller_AutopilotConnectorInterface_ResumeFlight_req_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ResumeFlight_req, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ResumeFlight_req_base__offset);
#pragma pack(push, 8) /* drone_controller_AutopilotConnectorInterface_ResumeFlight_res */
typedef struct drone_controller_AutopilotConnectorInterface_ResumeFlight_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_ResumeFlight_err;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ResumeFlight_err) == 24, bad_drone_controller_AutopilotConnectorInterface_ResumeFlight_err_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ResumeFlight_err, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ResumeFlight_err_base__offset);
typedef struct drone_controller_AutopilotConnectorInterface_ResumeFlight_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_AutopilotConnectorInterface_ResumeFlight_err err_;
            };
        }
drone_controller_AutopilotConnectorInterface_ResumeFlight_res;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ResumeFlight_res) == 32, bad_drone_controller_AutopilotConnectorInterface_ResumeFlight_res_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ResumeFlight_res, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ResumeFlight_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ResumeFlight_res, success) == 24, bad_drone_controller_AutopilotConnectorInterface_ResumeFlight_res_success_offset);
#pragma pack(pop) /* drone_controller_AutopilotConnectorInterface_ResumeFlight_res */
typedef struct __nk_packed drone_controller_AutopilotConnectorInterface_AbortMission_req {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_AbortMission_req;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_AbortMission_req) == 24, bad_drone_controller_AutopilotConnectorInterface_AbortMission_req_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_AbortMission_req, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_AbortMission_req_base__offset);
#pragma pack(push, 8) /* drone_controller_AutopilotConnectorInterface_AbortMission_res */
typedef struct drone_controller_AutopilotConnectorInterface_AbortMission_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_AbortMission_err;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_AbortMission_err) == 24, bad_drone_controller_AutopilotConnectorInterface_AbortMission_err_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_AbortMission_err, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_AbortMission_err_base__offset);
typedef struct drone_controller_AutopilotConnectorInterface_AbortMission_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_AutopilotConnectorInterface_AbortMission_err err_;
            };
        }
drone_controller_AutopilotConnectorInterface_AbortMission_res;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_AbortMission_res) == 32, bad_drone_controller_AutopilotConnectorInterface_AbortMission_res_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_AbortMission_res, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_AbortMission_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_AbortMission_res, success) == 24, bad_drone_controller_AutopilotConnectorInterface_AbortMission_res_success_offset);
#pragma pack(pop) /* drone_controller_AutopilotConnectorInterface_AbortMission_res */
typedef struct __nk_packed drone_controller_AutopilotConnectorInterface_ChangeSpeed_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(4) nk_sint32_t speed;
        }
drone_controller_AutopilotConnectorInterface_ChangeSpeed_req;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ChangeSpeed_req) == 32, bad_drone_controller_AutopilotConnectorInterface_ChangeSpeed_req_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeSpeed_req, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ChangeSpeed_req_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeSpeed_req, speed) == 24, bad_drone_controller_AutopilotConnectorInterface_ChangeSpeed_req_speed_offset);
#pragma pack(push, 8) /* drone_controller_AutopilotConnectorInterface_ChangeSpeed_res */
typedef struct drone_controller_AutopilotConnectorInterface_ChangeSpeed_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_ChangeSpeed_err;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ChangeSpeed_err) == 24, bad_drone_controller_AutopilotConnectorInterface_ChangeSpeed_err_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeSpeed_err, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ChangeSpeed_err_base__offset);
typedef struct drone_controller_AutopilotConnectorInterface_ChangeSpeed_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_AutopilotConnectorInterface_ChangeSpeed_err err_;
            };
        }
drone_controller_AutopilotConnectorInterface_ChangeSpeed_res;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ChangeSpeed_res) == 32, bad_drone_controller_AutopilotConnectorInterface_ChangeSpeed_res_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeSpeed_res, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ChangeSpeed_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeSpeed_res, success) == 24, bad_drone_controller_AutopilotConnectorInterface_ChangeSpeed_res_success_offset);
#pragma pack(pop) /* drone_controller_AutopilotConnectorInterface_ChangeSpeed_res */
typedef struct __nk_packed drone_controller_AutopilotConnectorInterface_ChangeAltitude_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(4) nk_sint32_t altitude;
        }
drone_controller_AutopilotConnectorInterface_ChangeAltitude_req;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ChangeAltitude_req) == 32, bad_drone_controller_AutopilotConnectorInterface_ChangeAltitude_req_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeAltitude_req, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ChangeAltitude_req_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeAltitude_req, altitude) == 24, bad_drone_controller_AutopilotConnectorInterface_ChangeAltitude_req_altitude_offset);
#pragma pack(push, 8) /* drone_controller_AutopilotConnectorInterface_ChangeAltitude_res */
typedef struct drone_controller_AutopilotConnectorInterface_ChangeAltitude_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_ChangeAltitude_err;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ChangeAltitude_err) == 24, bad_drone_controller_AutopilotConnectorInterface_ChangeAltitude_err_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeAltitude_err, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ChangeAltitude_err_base__offset);
typedef struct drone_controller_AutopilotConnectorInterface_ChangeAltitude_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_AutopilotConnectorInterface_ChangeAltitude_err err_;
            };
        }
drone_controller_AutopilotConnectorInterface_ChangeAltitude_res;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ChangeAltitude_res) == 32, bad_drone_controller_AutopilotConnectorInterface_ChangeAltitude_res_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeAltitude_res, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ChangeAltitude_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeAltitude_res, success) == 24, bad_drone_controller_AutopilotConnectorInterface_ChangeAltitude_res_success_offset);
#pragma pack(pop) /* drone_controller_AutopilotConnectorInterface_ChangeAltitude_res */
typedef struct __nk_packed drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(4) nk_sint32_t latitude;
            __nk_alignas(4) nk_sint32_t longitude;
            __nk_alignas(4) nk_sint32_t altitude;
        }
drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req) == 40, bad_drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req, latitude) == 24, bad_drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req_latitude_offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req, longitude) == 28, bad_drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req_longitude_offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req, altitude) == 32, bad_drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req_altitude_offset);
#pragma pack(push, 8) /* drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res */
typedef struct drone_controller_AutopilotConnectorInterface_ChangeWaypoint_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_ChangeWaypoint_err;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ChangeWaypoint_err) == 24, bad_drone_controller_AutopilotConnectorInterface_ChangeWaypoint_err_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeWaypoint_err, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ChangeWaypoint_err_base__offset);
typedef struct drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_AutopilotConnectorInterface_ChangeWaypoint_err err_;
            };
        }
drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res) == 32, bad_drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res, success) == 24, bad_drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res_success_offset);
#pragma pack(pop) /* drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res */
typedef struct __nk_packed drone_controller_AutopilotConnectorInterface_SetMission_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(4) nk_ptr_t mission;
            __nk_alignas(4) nk_uint32_t size;
        }
drone_controller_AutopilotConnectorInterface_SetMission_req;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_SetMission_req) == 40, bad_drone_controller_AutopilotConnectorInterface_SetMission_req_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_SetMission_req, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_SetMission_req_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_SetMission_req, mission) == 24, bad_drone_controller_AutopilotConnectorInterface_SetMission_req_mission_offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_SetMission_req, size) == 32, bad_drone_controller_AutopilotConnectorInterface_SetMission_req_size_offset);
#pragma pack(push, 8) /* drone_controller_AutopilotConnectorInterface_SetMission_res */
typedef struct drone_controller_AutopilotConnectorInterface_SetMission_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_AutopilotConnectorInterface_SetMission_err;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_SetMission_err) == 24, bad_drone_controller_AutopilotConnectorInterface_SetMission_err_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_SetMission_err, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_SetMission_err_base__offset);
typedef struct drone_controller_AutopilotConnectorInterface_SetMission_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_AutopilotConnectorInterface_SetMission_err err_;
            };
        }
drone_controller_AutopilotConnectorInterface_SetMission_res;
nk_static_assert(sizeof(drone_controller_AutopilotConnectorInterface_SetMission_res) == 32, bad_drone_controller_AutopilotConnectorInterface_SetMission_res_size);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_SetMission_res, base_) == 0, bad_drone_controller_AutopilotConnectorInterface_SetMission_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_AutopilotConnectorInterface_SetMission_res, success) == 24, bad_drone_controller_AutopilotConnectorInterface_SetMission_res_success_offset);
#pragma pack(pop) /* drone_controller_AutopilotConnectorInterface_SetMission_res */
#ifdef NK_USE_UNQUALIFIED_NAMES
#define AutopilotConnectorInterface_WaitForArmRequest_mid drone_controller_AutopilotConnectorInterface_WaitForArmRequest_mid
#define AutopilotConnectorInterface_PermitArm_mid drone_controller_AutopilotConnectorInterface_PermitArm_mid
#define AutopilotConnectorInterface_ForbidArm_mid drone_controller_AutopilotConnectorInterface_ForbidArm_mid
#define AutopilotConnectorInterface_PauseFlight_mid drone_controller_AutopilotConnectorInterface_PauseFlight_mid
#define AutopilotConnectorInterface_ResumeFlight_mid drone_controller_AutopilotConnectorInterface_ResumeFlight_mid
#define AutopilotConnectorInterface_AbortMission_mid drone_controller_AutopilotConnectorInterface_AbortMission_mid
#define AutopilotConnectorInterface_ChangeSpeed_mid drone_controller_AutopilotConnectorInterface_ChangeSpeed_mid
#define AutopilotConnectorInterface_ChangeAltitude_mid drone_controller_AutopilotConnectorInterface_ChangeAltitude_mid
#define AutopilotConnectorInterface_ChangeWaypoint_mid drone_controller_AutopilotConnectorInterface_ChangeWaypoint_mid
#define AutopilotConnectorInterface_SetMission_mid drone_controller_AutopilotConnectorInterface_SetMission_mid
#define AutopilotConnectorInterface_mid_max drone_controller_AutopilotConnectorInterface_mid_max
#define AutopilotConnectorInterface_WaitForArmRequest_req_arena_size drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req_arena_size
#define AutopilotConnectorInterface_WaitForArmRequest_res_arena_size drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res_arena_size
#define AutopilotConnectorInterface_WaitForArmRequest_req_handles drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req_handles
#define AutopilotConnectorInterface_WaitForArmRequest_res_handles drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res_handles
#define AutopilotConnectorInterface_WaitForArmRequest_err_handles drone_controller_AutopilotConnectorInterface_WaitForArmRequest_err_handles
#define AutopilotConnectorInterface_PermitArm_req_arena_size drone_controller_AutopilotConnectorInterface_PermitArm_req_arena_size
#define AutopilotConnectorInterface_PermitArm_res_arena_size drone_controller_AutopilotConnectorInterface_PermitArm_res_arena_size
#define AutopilotConnectorInterface_PermitArm_req_handles drone_controller_AutopilotConnectorInterface_PermitArm_req_handles
#define AutopilotConnectorInterface_PermitArm_res_handles drone_controller_AutopilotConnectorInterface_PermitArm_res_handles
#define AutopilotConnectorInterface_PermitArm_err_handles drone_controller_AutopilotConnectorInterface_PermitArm_err_handles
#define AutopilotConnectorInterface_ForbidArm_req_arena_size drone_controller_AutopilotConnectorInterface_ForbidArm_req_arena_size
#define AutopilotConnectorInterface_ForbidArm_res_arena_size drone_controller_AutopilotConnectorInterface_ForbidArm_res_arena_size
#define AutopilotConnectorInterface_ForbidArm_req_handles drone_controller_AutopilotConnectorInterface_ForbidArm_req_handles
#define AutopilotConnectorInterface_ForbidArm_res_handles drone_controller_AutopilotConnectorInterface_ForbidArm_res_handles
#define AutopilotConnectorInterface_ForbidArm_err_handles drone_controller_AutopilotConnectorInterface_ForbidArm_err_handles
#define AutopilotConnectorInterface_PauseFlight_req_arena_size drone_controller_AutopilotConnectorInterface_PauseFlight_req_arena_size
#define AutopilotConnectorInterface_PauseFlight_res_arena_size drone_controller_AutopilotConnectorInterface_PauseFlight_res_arena_size
#define AutopilotConnectorInterface_PauseFlight_req_handles drone_controller_AutopilotConnectorInterface_PauseFlight_req_handles
#define AutopilotConnectorInterface_PauseFlight_res_handles drone_controller_AutopilotConnectorInterface_PauseFlight_res_handles
#define AutopilotConnectorInterface_PauseFlight_err_handles drone_controller_AutopilotConnectorInterface_PauseFlight_err_handles
#define AutopilotConnectorInterface_ResumeFlight_req_arena_size drone_controller_AutopilotConnectorInterface_ResumeFlight_req_arena_size
#define AutopilotConnectorInterface_ResumeFlight_res_arena_size drone_controller_AutopilotConnectorInterface_ResumeFlight_res_arena_size
#define AutopilotConnectorInterface_ResumeFlight_req_handles drone_controller_AutopilotConnectorInterface_ResumeFlight_req_handles
#define AutopilotConnectorInterface_ResumeFlight_res_handles drone_controller_AutopilotConnectorInterface_ResumeFlight_res_handles
#define AutopilotConnectorInterface_ResumeFlight_err_handles drone_controller_AutopilotConnectorInterface_ResumeFlight_err_handles
#define AutopilotConnectorInterface_AbortMission_req_arena_size drone_controller_AutopilotConnectorInterface_AbortMission_req_arena_size
#define AutopilotConnectorInterface_AbortMission_res_arena_size drone_controller_AutopilotConnectorInterface_AbortMission_res_arena_size
#define AutopilotConnectorInterface_AbortMission_req_handles drone_controller_AutopilotConnectorInterface_AbortMission_req_handles
#define AutopilotConnectorInterface_AbortMission_res_handles drone_controller_AutopilotConnectorInterface_AbortMission_res_handles
#define AutopilotConnectorInterface_AbortMission_err_handles drone_controller_AutopilotConnectorInterface_AbortMission_err_handles
#define AutopilotConnectorInterface_ChangeSpeed_req_arena_size drone_controller_AutopilotConnectorInterface_ChangeSpeed_req_arena_size
#define AutopilotConnectorInterface_ChangeSpeed_res_arena_size drone_controller_AutopilotConnectorInterface_ChangeSpeed_res_arena_size
#define AutopilotConnectorInterface_ChangeSpeed_req_handles drone_controller_AutopilotConnectorInterface_ChangeSpeed_req_handles
#define AutopilotConnectorInterface_ChangeSpeed_res_handles drone_controller_AutopilotConnectorInterface_ChangeSpeed_res_handles
#define AutopilotConnectorInterface_ChangeSpeed_err_handles drone_controller_AutopilotConnectorInterface_ChangeSpeed_err_handles
#define AutopilotConnectorInterface_ChangeAltitude_req_arena_size drone_controller_AutopilotConnectorInterface_ChangeAltitude_req_arena_size
#define AutopilotConnectorInterface_ChangeAltitude_res_arena_size drone_controller_AutopilotConnectorInterface_ChangeAltitude_res_arena_size
#define AutopilotConnectorInterface_ChangeAltitude_req_handles drone_controller_AutopilotConnectorInterface_ChangeAltitude_req_handles
#define AutopilotConnectorInterface_ChangeAltitude_res_handles drone_controller_AutopilotConnectorInterface_ChangeAltitude_res_handles
#define AutopilotConnectorInterface_ChangeAltitude_err_handles drone_controller_AutopilotConnectorInterface_ChangeAltitude_err_handles
#define AutopilotConnectorInterface_ChangeWaypoint_req_arena_size drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req_arena_size
#define AutopilotConnectorInterface_ChangeWaypoint_res_arena_size drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res_arena_size
#define AutopilotConnectorInterface_ChangeWaypoint_req_handles drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req_handles
#define AutopilotConnectorInterface_ChangeWaypoint_res_handles drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res_handles
#define AutopilotConnectorInterface_ChangeWaypoint_err_handles drone_controller_AutopilotConnectorInterface_ChangeWaypoint_err_handles
#define AutopilotConnectorInterface_SetMission_req_mission_size drone_controller_AutopilotConnectorInterface_SetMission_req_mission_size
#define AutopilotConnectorInterface_SetMission_req_arena_size drone_controller_AutopilotConnectorInterface_SetMission_req_arena_size
#define AutopilotConnectorInterface_SetMission_res_arena_size drone_controller_AutopilotConnectorInterface_SetMission_res_arena_size
#define AutopilotConnectorInterface_SetMission_req_handles drone_controller_AutopilotConnectorInterface_SetMission_req_handles
#define AutopilotConnectorInterface_SetMission_res_handles drone_controller_AutopilotConnectorInterface_SetMission_res_handles
#define AutopilotConnectorInterface_SetMission_err_handles drone_controller_AutopilotConnectorInterface_SetMission_err_handles
#define AutopilotConnectorInterface_req_arena_size drone_controller_AutopilotConnectorInterface_req_arena_size
#define AutopilotConnectorInterface_res_arena_size drone_controller_AutopilotConnectorInterface_res_arena_size
#define AutopilotConnectorInterface_req_handles drone_controller_AutopilotConnectorInterface_req_handles
#define AutopilotConnectorInterface_res_handles drone_controller_AutopilotConnectorInterface_res_handles
#define AutopilotConnectorInterface_err_handles drone_controller_AutopilotConnectorInterface_err_handles
#define AutopilotConnectorInterface_WaitForArmRequest_req drone_controller_AutopilotConnectorInterface_WaitForArmRequest_req
#define AutopilotConnectorInterface_WaitForArmRequest_res drone_controller_AutopilotConnectorInterface_WaitForArmRequest_res
#define AutopilotConnectorInterface_PermitArm_req drone_controller_AutopilotConnectorInterface_PermitArm_req
#define AutopilotConnectorInterface_PermitArm_res drone_controller_AutopilotConnectorInterface_PermitArm_res
#define AutopilotConnectorInterface_ForbidArm_req drone_controller_AutopilotConnectorInterface_ForbidArm_req
#define AutopilotConnectorInterface_ForbidArm_res drone_controller_AutopilotConnectorInterface_ForbidArm_res
#define AutopilotConnectorInterface_PauseFlight_req drone_controller_AutopilotConnectorInterface_PauseFlight_req
#define AutopilotConnectorInterface_PauseFlight_res drone_controller_AutopilotConnectorInterface_PauseFlight_res
#define AutopilotConnectorInterface_ResumeFlight_req drone_controller_AutopilotConnectorInterface_ResumeFlight_req
#define AutopilotConnectorInterface_ResumeFlight_res drone_controller_AutopilotConnectorInterface_ResumeFlight_res
#define AutopilotConnectorInterface_AbortMission_req drone_controller_AutopilotConnectorInterface_AbortMission_req
#define AutopilotConnectorInterface_AbortMission_res drone_controller_AutopilotConnectorInterface_AbortMission_res
#define AutopilotConnectorInterface_ChangeSpeed_req drone_controller_AutopilotConnectorInterface_ChangeSpeed_req
#define AutopilotConnectorInterface_ChangeSpeed_res drone_controller_AutopilotConnectorInterface_ChangeSpeed_res
#define AutopilotConnectorInterface_ChangeAltitude_req drone_controller_AutopilotConnectorInterface_ChangeAltitude_req
#define AutopilotConnectorInterface_ChangeAltitude_res drone_controller_AutopilotConnectorInterface_ChangeAltitude_res
#define AutopilotConnectorInterface_ChangeWaypoint_req drone_controller_AutopilotConnectorInterface_ChangeWaypoint_req
#define AutopilotConnectorInterface_ChangeWaypoint_res drone_controller_AutopilotConnectorInterface_ChangeWaypoint_res
#define AutopilotConnectorInterface_SetMission_req drone_controller_AutopilotConnectorInterface_SetMission_req
#define AutopilotConnectorInterface_SetMission_res drone_controller_AutopilotConnectorInterface_SetMission_res
#endif /* NK_USE_UNQUALIFIED_NAMES */

#endif /* __drone_controller__AutopilotConnectorInterface__INTERFACE__ */

#ifndef __drone_controller__Initialization__INTERFACE__
#define __drone_controller__Initialization__INTERFACE__
enum {
    drone_controller_Initialization_WaitForInit_mid,
    drone_controller_Initialization_mid_max,
};
enum {
    drone_controller_Initialization_WaitForInit_req_arena_size =
    0,
    drone_controller_Initialization_WaitForInit_res_arena_size =
    0,
    drone_controller_Initialization_WaitForInit_req_handles =
    0,
    drone_controller_Initialization_WaitForInit_res_handles =
    0,
    drone_controller_Initialization_WaitForInit_err_handles =
    0,
    drone_controller_Initialization_req_arena_size =
    0,
    drone_controller_Initialization_res_arena_size =
    0,
    drone_controller_Initialization_req_handles =
    0,
    drone_controller_Initialization_res_handles =
    0,
    drone_controller_Initialization_err_handles =
    0,
};
typedef struct __nk_packed drone_controller_Initialization_WaitForInit_req {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_Initialization_WaitForInit_req;
nk_static_assert(sizeof(drone_controller_Initialization_WaitForInit_req) == 24, bad_drone_controller_Initialization_WaitForInit_req_size);
nk_static_assert(nk_offsetof(drone_controller_Initialization_WaitForInit_req, base_) == 0, bad_drone_controller_Initialization_WaitForInit_req_base__offset);
#pragma pack(push, 8) /* drone_controller_Initialization_WaitForInit_res */
typedef struct drone_controller_Initialization_WaitForInit_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_Initialization_WaitForInit_err;
nk_static_assert(sizeof(drone_controller_Initialization_WaitForInit_err) == 24, bad_drone_controller_Initialization_WaitForInit_err_size);
nk_static_assert(nk_offsetof(drone_controller_Initialization_WaitForInit_err, base_) == 0, bad_drone_controller_Initialization_WaitForInit_err_base__offset);
typedef struct drone_controller_Initialization_WaitForInit_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_Initialization_WaitForInit_err err_;
            };
        }
drone_controller_Initialization_WaitForInit_res;
nk_static_assert(sizeof(drone_controller_Initialization_WaitForInit_res) == 32, bad_drone_controller_Initialization_WaitForInit_res_size);
nk_static_assert(nk_offsetof(drone_controller_Initialization_WaitForInit_res, base_) == 0, bad_drone_controller_Initialization_WaitForInit_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_Initialization_WaitForInit_res, success) == 24, bad_drone_controller_Initialization_WaitForInit_res_success_offset);
#pragma pack(pop) /* drone_controller_Initialization_WaitForInit_res */
#ifdef NK_USE_UNQUALIFIED_NAMES
#define Initialization_WaitForInit_mid drone_controller_Initialization_WaitForInit_mid
#define Initialization_mid_max drone_controller_Initialization_mid_max
#define Initialization_WaitForInit_req_arena_size drone_controller_Initialization_WaitForInit_req_arena_size
#define Initialization_WaitForInit_res_arena_size drone_controller_Initialization_WaitForInit_res_arena_size
#define Initialization_WaitForInit_req_handles drone_controller_Initialization_WaitForInit_req_handles
#define Initialization_WaitForInit_res_handles drone_controller_Initialization_WaitForInit_res_handles
#define Initialization_WaitForInit_err_handles drone_controller_Initialization_WaitForInit_err_handles
