#pragma GCC diagnostic push
/**
 * This file was automatically generated by nk-gen-c.
 * The following copyright applies to the portions of nk-gen-c located in this file:
 * (C) 2024 AO Kaspersky Lab. All Rights Reserved.
 */

#include <nk/transport.h>
#include <nk/types.h>
#include <nk/layout.h>
#ifndef __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
#define __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
nk_static_assert(__NK_SIZEOF_NK_HANDLE_DESC_T == 16, __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
nk_static_assert(__NK_ALIGNOF_NK_HANDLE_DESC_T == 8, __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
#define __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
nk_static_assert(__NK_SIZEOF_NK_PTR_T == 8, __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
#define __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
nk_static_assert(__NK_ALIGNOF_NK_PTR_T == 4, __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
#define __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
nk_static_assert(__NK_SIZEOF_NK_MESSAGE == 24, __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
nk_static_assert(__NK_ALIGNOF_NK_MESSAGE == 8, __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
#define __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
nk_static_assert(__NK_MESSAGE_SIZE_MAX == 8388607, __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
#define __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
nk_static_assert(__NK_MESSAGE_HANDLES_MAX == 255, __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255_FAIL);
#endif
#ifndef __NK_ASSERT___NK_IID_MAX_IS_65535
#define __NK_ASSERT___NK_IID_MAX_IS_65535
nk_static_assert(__NK_IID_MAX == 65535, __NK_ASSERT___NK_IID_MAX_IS_65535_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MID_MAX_IS_65535
#define __NK_ASSERT___NK_MID_MAX_IS_65535
nk_static_assert(__NK_MID_MAX == 65535, __NK_ASSERT___NK_MID_MAX_IS_65535_FAIL);
#endif

#ifndef __NK_GEN_CPP_MANGLE
#  ifdef __cplusplus
#    define __NK_GEN_CPP_MANGLE(name) name ## _
#  else
#    define __NK_GEN_CPP_MANGLE(name) name
#  endif
#endif

#ifdef __cplusplus
    extern "C" {
#endif

#ifndef ____nk_ptr_t__NKTYPE__
#define ____nk_ptr_t__NKTYPE__
nk_static_assert(sizeof(nk_ptr_t) == 8, bad_nk_ptr_t_size);
nk_static_assert(nk_alignof(nk_ptr_t) == 4, bad_nk_ptr_t_align);

#endif /* ____nk_ptr_t__NKTYPE__ */

#ifndef ____UInt16__RAWTYPE__
#define ____UInt16__RAWTYPE__
nk_static_assert(sizeof(nk_uint16_t) == 2, bad_nk_uint16_t_size);
nk_static_assert(nk_alignof(nk_uint16_t) == 2, bad_nk_uint16_t_align);

#endif /* ____UInt16__RAWTYPE__ */

#ifndef ____UInt8__RAWTYPE__
#define ____UInt8__RAWTYPE__
nk_static_assert(sizeof(nk_uint8_t) == 1, bad_nk_uint8_t_size);
nk_static_assert(nk_alignof(nk_uint8_t) == 1, bad_nk_uint8_t_align);

#endif /* ____UInt8__RAWTYPE__ */

#ifndef __drone_controller_CredentialManagerInterface__MaxMessageLength__CONST__
#define __drone_controller_CredentialManagerInterface__MaxMessageLength__CONST__
#define drone_controller_CredentialManagerInterface_MaxMessageLength ((nk_uint16_t)(NK_UINT16_C(4096)))
#ifdef NK_USE_UNQUALIFIED_NAMES
#define CredentialManagerInterface_MaxMessageLength drone_controller_CredentialManagerInterface_MaxMessageLength
#endif /* NK_USE_UNQUALIFIED_NAMES */

#endif /* __drone_controller_CredentialManagerInterface__MaxMessageLength__CONST__ */

#ifndef __drone_controller_CredentialManagerInterface__MaxSignatureLength__CONST__
#define __drone_controller_CredentialManagerInterface__MaxSignatureLength__CONST__
#define drone_controller_CredentialManagerInterface_MaxSignatureLength ((nk_uint16_t)(NK_UINT16_C(257)))
#ifdef NK_USE_UNQUALIFIED_NAMES
#define CredentialManagerInterface_MaxSignatureLength drone_controller_CredentialManagerInterface_MaxSignatureLength
#endif /* NK_USE_UNQUALIFIED_NAMES */

#endif /* __drone_controller_CredentialManagerInterface__MaxSignatureLength__CONST__ */

#ifndef __drone_controller__CredentialManagerInterface__INTERFACE__
#define __drone_controller__CredentialManagerInterface__INTERFACE__
enum {
    drone_controller_CredentialManagerInterface_SignMessage_mid,
    drone_controller_CredentialManagerInterface_CheckSignature_mid,
    drone_controller_CredentialManagerInterface_mid_max,
};
enum {
    drone_controller_CredentialManagerInterface_SignMessage_req_message_size =
    4097,
    drone_controller_CredentialManagerInterface_SignMessage_res_signature_size =
    258,
    drone_controller_CredentialManagerInterface_SignMessage_req_arena_size =
    4097,
    drone_controller_CredentialManagerInterface_SignMessage_res_arena_size =
    258,
    drone_controller_CredentialManagerInterface_SignMessage_req_handles =
    0,
    drone_controller_CredentialManagerInterface_SignMessage_res_handles =
    0,
    drone_controller_CredentialManagerInterface_SignMessage_err_handles =
    0,
    drone_controller_CredentialManagerInterface_CheckSignature_req_message_size =
    4097,
    drone_controller_CredentialManagerInterface_CheckSignature_req_arena_size =
    4097,
    drone_controller_CredentialManagerInterface_CheckSignature_res_arena_size =
    0,
    drone_controller_CredentialManagerInterface_CheckSignature_req_handles =
    0,
    drone_controller_CredentialManagerInterface_CheckSignature_res_handles =
    0,
    drone_controller_CredentialManagerInterface_CheckSignature_err_handles =
    0,
    drone_controller_CredentialManagerInterface_req_arena_size =
    4097,
    drone_controller_CredentialManagerInterface_res_arena_size =
    258,
    drone_controller_CredentialManagerInterface_req_handles =
    0,
    drone_controller_CredentialManagerInterface_res_handles =
    0,
    drone_controller_CredentialManagerInterface_err_handles =
    0,
};
typedef struct __nk_packed drone_controller_CredentialManagerInterface_SignMessage_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(4) nk_ptr_t message;
        }
drone_controller_CredentialManagerInterface_SignMessage_req;
nk_static_assert(sizeof(drone_controller_CredentialManagerInterface_SignMessage_req) == 32, bad_drone_controller_CredentialManagerInterface_SignMessage_req_size);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_SignMessage_req, base_) == 0, bad_drone_controller_CredentialManagerInterface_SignMessage_req_base__offset);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_SignMessage_req, message) == 24, bad_drone_controller_CredentialManagerInterface_SignMessage_req_message_offset);
#pragma pack(push, 8) /* drone_controller_CredentialManagerInterface_SignMessage_res */
typedef struct drone_controller_CredentialManagerInterface_SignMessage_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_CredentialManagerInterface_SignMessage_err;
nk_static_assert(sizeof(drone_controller_CredentialManagerInterface_SignMessage_err) == 24, bad_drone_controller_CredentialManagerInterface_SignMessage_err_size);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_SignMessage_err, base_) == 0, bad_drone_controller_CredentialManagerInterface_SignMessage_err_base__offset);
typedef struct drone_controller_CredentialManagerInterface_SignMessage_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                    __nk_alignas(4)
                    nk_ptr_t signature;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                    __nk_alignas(4)
                    nk_ptr_t signature;
                } res_;
                struct drone_controller_CredentialManagerInterface_SignMessage_err err_;
            };
        }
drone_controller_CredentialManagerInterface_SignMessage_res;
nk_static_assert(sizeof(drone_controller_CredentialManagerInterface_SignMessage_res) == 40, bad_drone_controller_CredentialManagerInterface_SignMessage_res_size);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_SignMessage_res, base_) == 0, bad_drone_controller_CredentialManagerInterface_SignMessage_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_SignMessage_res, success) == 24, bad_drone_controller_CredentialManagerInterface_SignMessage_res_success_offset);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_SignMessage_res, signature) == 28, bad_drone_controller_CredentialManagerInterface_SignMessage_res_signature_offset);
#pragma pack(pop) /* drone_controller_CredentialManagerInterface_SignMessage_res */
typedef struct __nk_packed drone_controller_CredentialManagerInterface_CheckSignature_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(4) nk_ptr_t message;
        }
drone_controller_CredentialManagerInterface_CheckSignature_req;
nk_static_assert(sizeof(drone_controller_CredentialManagerInterface_CheckSignature_req) == 32, bad_drone_controller_CredentialManagerInterface_CheckSignature_req_size);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_CheckSignature_req, base_) == 0, bad_drone_controller_CredentialManagerInterface_CheckSignature_req_base__offset);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_CheckSignature_req, message) == 24, bad_drone_controller_CredentialManagerInterface_CheckSignature_req_message_offset);
#pragma pack(push, 8) /* drone_controller_CredentialManagerInterface_CheckSignature_res */
typedef struct drone_controller_CredentialManagerInterface_CheckSignature_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_CredentialManagerInterface_CheckSignature_err;
nk_static_assert(sizeof(drone_controller_CredentialManagerInterface_CheckSignature_err) == 24, bad_drone_controller_CredentialManagerInterface_CheckSignature_err_size);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_CheckSignature_err, base_) == 0, bad_drone_controller_CredentialManagerInterface_CheckSignature_err_base__offset);
typedef struct drone_controller_CredentialManagerInterface_CheckSignature_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                    __nk_alignas(1)
                    nk_uint8_t correct;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                    __nk_alignas(1)
                    nk_uint8_t correct;
                } res_;
                struct drone_controller_CredentialManagerInterface_CheckSignature_err err_;
            };
        }
drone_controller_CredentialManagerInterface_CheckSignature_res;
nk_static_assert(sizeof(drone_controller_CredentialManagerInterface_CheckSignature_res) == 32, bad_drone_controller_CredentialManagerInterface_CheckSignature_res_size);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_CheckSignature_res, base_) == 0, bad_drone_controller_CredentialManagerInterface_CheckSignature_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_CheckSignature_res, success) == 24, bad_drone_controller_CredentialManagerInterface_CheckSignature_res_success_offset);
nk_static_assert(nk_offsetof(drone_controller_CredentialManagerInterface_CheckSignature_res, correct) == 25, bad_drone_controller_CredentialManagerInterface_CheckSignature_res_correct_offset);
#pragma pack(pop) /* drone_controller_CredentialManagerInterface_CheckSignature_res */
#ifdef NK_USE_UNQUALIFIED_NAMES
#define CredentialManagerInterface_SignMessage_mid drone_controller_CredentialManagerInterface_SignMessage_mid
#define CredentialManagerInterface_CheckSignature_mid drone_controller_CredentialManagerInterface_CheckSignature_mid
#define CredentialManagerInterface_mid_max drone_controller_CredentialManagerInterface_mid_max
#define CredentialManagerInterface_SignMessage_req_message_size drone_controller_CredentialManagerInterface_SignMessage_req_message_size
#define CredentialManagerInterface_SignMessage_res_signature_size drone_controller_CredentialManagerInterface_SignMessage_res_signature_size
