#pragma GCC diagnostic push
/**
 * This file was automatically generated by nk-gen-c.
 * The following copyright applies to the portions of nk-gen-c located in this file:
 * (C) 2024 AO Kaspersky Lab. All Rights Reserved.
 */

#include <nk/transport.h>
#include <nk/types.h>
#include <nk/layout.h>
#ifndef __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
#define __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
nk_static_assert(__NK_SIZEOF_NK_HANDLE_DESC_T == 16, __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
nk_static_assert(__NK_ALIGNOF_NK_HANDLE_DESC_T == 8, __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
#define __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
nk_static_assert(__NK_SIZEOF_NK_PTR_T == 8, __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
#define __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
nk_static_assert(__NK_ALIGNOF_NK_PTR_T == 4, __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
#define __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
nk_static_assert(__NK_SIZEOF_NK_MESSAGE == 24, __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
nk_static_assert(__NK_ALIGNOF_NK_MESSAGE == 8, __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
#define __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
nk_static_assert(__NK_MESSAGE_SIZE_MAX == 8388607, __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
#define __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
nk_static_assert(__NK_MESSAGE_HANDLES_MAX == 255, __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255_FAIL);
#endif
#ifndef __NK_ASSERT___NK_IID_MAX_IS_65535
#define __NK_ASSERT___NK_IID_MAX_IS_65535
nk_static_assert(__NK_IID_MAX == 65535, __NK_ASSERT___NK_IID_MAX_IS_65535_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MID_MAX_IS_65535
#define __NK_ASSERT___NK_MID_MAX_IS_65535
nk_static_assert(__NK_MID_MAX == 65535, __NK_ASSERT___NK_MID_MAX_IS_65535_FAIL);
#endif

#ifndef __NK_GEN_CPP_MANGLE
#  ifdef __cplusplus
#    define __NK_GEN_CPP_MANGLE(name) name ## _
#  else
#    define __NK_GEN_CPP_MANGLE(name) name
#  endif
#endif

#ifdef __cplusplus
    extern "C" {
#endif

#ifndef ____nk_ptr_t__NKTYPE__
#define ____nk_ptr_t__NKTYPE__
nk_static_assert(sizeof(nk_ptr_t) == 8, bad_nk_ptr_t_size);
nk_static_assert(nk_alignof(nk_ptr_t) == 4, bad_nk_ptr_t_align);

#endif /* ____nk_ptr_t__NKTYPE__ */

#ifndef ____UInt16__RAWTYPE__
#define ____UInt16__RAWTYPE__
nk_static_assert(sizeof(nk_uint16_t) == 2, bad_nk_uint16_t_size);
nk_static_assert(nk_alignof(nk_uint16_t) == 2, bad_nk_uint16_t_align);

#endif /* ____UInt16__RAWTYPE__ */

#ifndef ____UInt8__RAWTYPE__
#define ____UInt8__RAWTYPE__
nk_static_assert(sizeof(nk_uint8_t) == 1, bad_nk_uint8_t_size);
nk_static_assert(nk_alignof(nk_uint8_t) == 1, bad_nk_uint8_t_align);

#endif /* ____UInt8__RAWTYPE__ */

#ifndef __drone_controller_LoggerInterface__MaxLogEntry__CONST__
#define __drone_controller_LoggerInterface__MaxLogEntry__CONST__
#define drone_controller_LoggerInterface_MaxLogEntry ((nk_uint16_t)(NK_UINT16_C(1024)))
#ifdef NK_USE_UNQUALIFIED_NAMES
#define LoggerInterface_MaxLogEntry drone_controller_LoggerInterface_MaxLogEntry
#endif /* NK_USE_UNQUALIFIED_NAMES */

#endif /* __drone_controller_LoggerInterface__MaxLogEntry__CONST__ */

#ifndef __drone_controller__LoggerInterface__INTERFACE__
#define __drone_controller__LoggerInterface__INTERFACE__
enum {
    drone_controller_LoggerInterface_Log_mid,
    drone_controller_LoggerInterface_mid_max,
};
enum {
    drone_controller_LoggerInterface_Log_req_logEntry_size =
    1025,
    drone_controller_LoggerInterface_Log_req_arena_size =
    1025,
    drone_controller_LoggerInterface_Log_res_arena_size =
    0,
    drone_controller_LoggerInterface_Log_req_handles =
    0,
    drone_controller_LoggerInterface_Log_res_handles =
    0,
    drone_controller_LoggerInterface_Log_err_handles =
    0,
    drone_controller_LoggerInterface_req_arena_size =
    1025,
    drone_controller_LoggerInterface_res_arena_size =
    0,
    drone_controller_LoggerInterface_req_handles =
    0,
    drone_controller_LoggerInterface_res_handles =
    0,
    drone_controller_LoggerInterface_err_handles =
    0,
};
typedef struct __nk_packed drone_controller_LoggerInterface_Log_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(4) nk_ptr_t logEntry;
            __nk_alignas(1) nk_uint8_t logLevel;
        }
drone_controller_LoggerInterface_Log_req;
nk_static_assert(sizeof(drone_controller_LoggerInterface_Log_req) == 40, bad_drone_controller_LoggerInterface_Log_req_size);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_req, base_) == 0, bad_drone_controller_LoggerInterface_Log_req_base__offset);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_req, logEntry) == 24, bad_drone_controller_LoggerInterface_Log_req_logEntry_offset);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_req, logLevel) == 32, bad_drone_controller_LoggerInterface_Log_req_logLevel_offset);
#pragma pack(push, 8) /* drone_controller_LoggerInterface_Log_res */
typedef struct drone_controller_LoggerInterface_Log_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_LoggerInterface_Log_err;
nk_static_assert(sizeof(drone_controller_LoggerInterface_Log_err) == 24, bad_drone_controller_LoggerInterface_Log_err_size);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_err, base_) == 0, bad_drone_controller_LoggerInterface_Log_err_base__offset);
typedef struct drone_controller_LoggerInterface_Log_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_LoggerInterface_Log_err err_;
            };
        }
drone_controller_LoggerInterface_Log_res;
nk_static_assert(sizeof(drone_controller_LoggerInterface_Log_res) == 32, bad_drone_controller_LoggerInterface_Log_res_size);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_res, base_) == 0, bad_drone_controller_LoggerInterface_Log_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_res, success) == 24, bad_drone_controller_LoggerInterface_Log_res_success_offset);
#pragma pack(pop) /* drone_controller_LoggerInterface_Log_res */
#ifdef NK_USE_UNQUALIFIED_NAMES
#define LoggerInterface_Log_mid drone_controller_LoggerInterface_Log_mid
#define LoggerInterface_mid_max drone_controller_LoggerInterface_mid_max
#define LoggerInterface_Log_req_logEntry_size drone_controller_LoggerInterface_Log_req_logEntry_size
#define LoggerInterface_Log_req_arena_size drone_controller_LoggerInterface_Log_req_arena_size
#define LoggerInterface_Log_res_arena_size drone_controller_LoggerInterface_Log_res_arena_size
#define LoggerInterface_Log_req_handles drone_controller_LoggerInterface_Log_req_handles
#define LoggerInterface_Log_res_handles drone_controller_LoggerInterface_Log_res_handles
#define LoggerInterface_Log_err_handles drone_controller_LoggerInterface_Log_err_handles
#define LoggerInterface_req_arena_size drone_controller_LoggerInterface_req_arena_size
#define LoggerInterface_res_arena_size drone_controller_LoggerInterface_res_arena_size
#define LoggerInterface_req_handles drone_controller_LoggerInterface_req_handles
#define LoggerInterface_res_handles drone_controller_LoggerInterface_res_handles
#define LoggerInterface_err_handles drone_controller_LoggerInterface_err_handles
#define LoggerInterface_Log_req drone_controller_LoggerInterface_Log_req
#define LoggerInterface_Log_res drone_controller_LoggerInterface_Log_res
#endif /* NK_USE_UNQUALIFIED_NAMES */

#endif /* __drone_controller__LoggerInterface__INTERFACE__ */

#ifndef __drone_controller__LoggerInterface__VTABLE__
#define __drone_controller__LoggerInterface__VTABLE__
typedef struct drone_controller_LoggerInterface {
            const
            struct drone_controller_LoggerInterface_ops *ops;
        } drone_controller_LoggerInterface;
typedef nk_err_t
drone_controller_LoggerInterface_Log_fn(struct drone_controller_LoggerInterface *,
                                        const
                                        struct drone_controller_LoggerInterface_Log_req *,
                                        const
                                        struct nk_arena *,
                                        struct drone_controller_LoggerInterface_Log_res *,
                                        struct nk_arena *);
typedef struct drone_controller_LoggerInterface_ops {
            drone_controller_LoggerInterface_Log_fn *Log;
        } drone_controller_LoggerInterface_ops;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define LoggerInterface_Log_fn drone_controller_LoggerInterface_Log_fn
#define LoggerInterface_ops drone_controller_LoggerInterface_ops
#define LoggerInterface drone_controller_LoggerInterface
#endif /* NK_USE_UNQUALIFIED_NAMES */

#endif /* __drone_controller__LoggerInterface__VTABLE__ */

#ifndef __drone_controller__LoggerInterface__CLIENT__
#define __drone_controller__LoggerInterface__CLIENT__
typedef struct drone_controller_LoggerInterface_proxy {
            struct drone_controller_LoggerInterface base;
            struct nk_transport *transport;
            nk_iid_t iid;
        } drone_controller_LoggerInterface_proxy;
static inline
nk_err_t drone_controller_LoggerInterface_Log_proxy(struct drone_controller_LoggerInterface_proxy *self,
                                                    struct drone_controller_LoggerInterface_Log_req *req,
                                                    const
                                                    struct nk_arena *req_arena,
                                                    struct drone_controller_LoggerInterface_Log_res *res,
                                                    struct nk_arena *res_arena)
{
    nk_err_t rc;
    
    nk_assert(self != NK_NULL);
    nk_assert(req != NK_NULL);
    nk_assert(res != NK_NULL);
    nk_req_reset(req);
    nk_msg_set_method_id(req, self->iid,
                         drone_controller_LoggerInterface_Log_mid);
    nk_msg_set_ncaps(req,
                     drone_controller_LoggerInterface_Log_req_handles);
    nk_req_reset(res);
    nk_msg_set_method_id(res, self->iid,
                         drone_controller_LoggerInterface_Log_mid);
    nk_msg_set_ncaps(res,
                     drone_controller_LoggerInterface_Log_res_handles);
    rc = nk_transport_call(self->transport,
                           &req->base_, req_arena,
                           &res->base_,
                           res_arena);
    return rc;
}
static inline
void drone_controller_LoggerInterface_proxy_init(struct drone_controller_LoggerInterface_proxy *self,
                                                 struct nk_transport *transport,
                                                 nk_iid_t iid)
{
    static const
    struct drone_controller_LoggerInterface_ops
    ops = {NK_NULL};
    
    nk_assert(self != NK_NULL);
    self->base.ops = &ops;
    self->transport = transport;
    self->iid = iid;
}
static inline
nk_err_t drone_controller_LoggerInterface_Log(struct drone_controller_LoggerInterface *self,
                                              struct drone_controller_LoggerInterface_Log_req *req,
                                              const
                                              struct nk_arena *req_arena,
                                              struct drone_controller_LoggerInterface_Log_res *res,
                                              struct nk_arena *res_arena)
{
    return drone_controller_LoggerInterface_Log_proxy((struct drone_controller_LoggerInterface_proxy *) self,
                                                      req,
                                                      req_arena,
                                                      res,
                                                      res_arena);
}
#ifdef NK_USE_UNQUALIFIED_NAMES
#define LoggerInterface_Log drone_controller_LoggerInterface_Log
#define LoggerInterface_proxy drone_controller_LoggerInterface_proxy
#define LoggerInterface_proxy_init drone_controller_LoggerInterface_proxy_init
#endif /* NK_USE_UNQUALIFIED_NAMES */

#endif /* __drone_controller__LoggerInterface__CLIENT__ */

#ifndef __drone_controller__LoggerInterface__SERVER__
#define __drone_controller__LoggerInterface__SERVER__
typedef union drone_controller_LoggerInterface_req {
            struct nk_message base_;
            struct drone_controller_LoggerInterface_Log_req Log;
        } drone_controller_LoggerInterface_req;
typedef union drone_controller_LoggerInterface_res {
            struct nk_message base_;
            struct drone_controller_LoggerInterface_Log_res Log;
        } drone_controller_LoggerInterface_res;
static inline
nk_err_t drone_controller_LoggerInterface_interface_dispatch(struct drone_controller_LoggerInterface *impl,
                                                             nk_iid_t iid,
                                                             const
                                                             struct nk_message *req,
                                                             const
                                                             struct nk_arena *req_arena,
                                                             struct nk_message *res,
                                                             struct nk_arena *res_arena)
{
    nk_err_t rc = NK_ENOENT;
    nk_iid_t req_iid;
    nk_mid_t req_mid;
    
    nk_assert(impl != NK_NULL);
    nk_assert(req != NK_NULL);
    nk_assert(res != NK_NULL);
    nk_unused(impl);
    nk_unused(req_arena);
    nk_unused(res_arena);
    if (req->iid == iid) {
        req_iid = req->iid;
        req_mid = req->mid;
        switch (req->mid) {
            
          case drone_controller_LoggerInterface_Log_mid:
            {
                struct drone_controller_LoggerInterface_Log_res
                *res_ =
                (struct drone_controller_LoggerInterface_Log_res *) res;
                
                /* Workaround GCC bug https://gcc.gnu.org/bugzilla/show_bug.cgi?id=101525 */
                #pragma GCC diagnostic push
                #pragma GCC diagnostic ignored "-Warray-bounds"
                (void) nk_memset(res_, 0,
                                 sizeof(*res_));
                #pragma GCC diagnostic pop
                rc = impl->ops->Log(impl, (const
                                           struct drone_controller_LoggerInterface_Log_req *) req,
                                    req_arena,
                                    res_,
                                    res_arena);
                if (rc == NK_EOK) {
                    if (nk_msg_check_err(res)) {
                        nk_err_reset(&res_->err_);
                        nk_msg_set_ncaps(res_,
                                         drone_controller_LoggerInterface_Log_err_handles);
                    } else {
                        nk_req_reset(&res_->res_);
                        nk_msg_set_ncaps(res_,
                                         drone_controller_LoggerInterface_Log_res_handles);
                    }
                }
                break;
            }
            
          default:
            ;
        }
        res->iid = req_iid;
        res->mid = req_mid;
    }
    return rc;
}
#ifdef NK_USE_UNQUALIFIED_NAMES
#define LoggerInterface_req drone_controller_LoggerInterface_req
#define LoggerInterface_res drone_controller_LoggerInterface_res
#define LoggerInterface_interface_dispatch drone_controller_LoggerInterface_interface_dispatch
#endif /* NK_USE_UNQUALIFIED_NAMES */

#endif /* __drone_controller__LoggerInterface__SERVER__ */

#ifdef __cplusplus
    }
#endif

#pragma GCC diagnostic pop

