#pragma GCC diagnostic push
/**
 * This file was automatically generated by nk-gen-c.
 * The following copyright applies to the portions of nk-gen-c located in this file:
 * (C) 2024 AO Kaspersky Lab. All Rights Reserved.
 */

#include <nk/transport.h>
#include <nk/types.h>
#include <nk/layout.h>
#ifndef __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
#define __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
nk_static_assert(__NK_SIZEOF_NK_HANDLE_DESC_T == 16, __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
nk_static_assert(__NK_ALIGNOF_NK_HANDLE_DESC_T == 8, __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
#define __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
nk_static_assert(__NK_SIZEOF_NK_PTR_T == 8, __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
#define __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
nk_static_assert(__NK_ALIGNOF_NK_PTR_T == 4, __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
#define __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
nk_static_assert(__NK_SIZEOF_NK_MESSAGE == 24, __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
nk_static_assert(__NK_ALIGNOF_NK_MESSAGE == 8, __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
#define __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
nk_static_assert(__NK_MESSAGE_SIZE_MAX == 8388607, __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
#define __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
nk_static_assert(__NK_MESSAGE_HANDLES_MAX == 255, __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255_FAIL);
#endif
#ifndef __NK_ASSERT___NK_IID_MAX_IS_65535
#define __NK_ASSERT___NK_IID_MAX_IS_65535
nk_static_assert(__NK_IID_MAX == 65535, __NK_ASSERT___NK_IID_MAX_IS_65535_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MID_MAX_IS_65535
#define __NK_ASSERT___NK_MID_MAX_IS_65535
nk_static_assert(__NK_MID_MAX == 65535, __NK_ASSERT___NK_MID_MAX_IS_65535_FAIL);
#endif

#ifndef __NK_GEN_CPP_MANGLE
#  ifdef __cplusplus
#    define __NK_GEN_CPP_MANGLE(name) name ## _
#  else
#    define __NK_GEN_CPP_MANGLE(name) name
#  endif
#endif

#ifdef __cplusplus
    extern "C" {
#endif

#ifndef ____nk_ptr_t__NKTYPE__
#define ____nk_ptr_t__NKTYPE__
nk_static_assert(sizeof(nk_ptr_t) == 8, bad_nk_ptr_t_size);
nk_static_assert(nk_alignof(nk_ptr_t) == 4, bad_nk_ptr_t_align);

#endif /* ____nk_ptr_t__NKTYPE__ */

#ifndef ____UInt8__RAWTYPE__
#define ____UInt8__RAWTYPE__
nk_static_assert(sizeof(nk_uint8_t) == 1, bad_nk_uint8_t_size);
nk_static_assert(nk_alignof(nk_uint8_t) == 1, bad_nk_uint8_t_align);

#endif /* ____UInt8__RAWTYPE__ */

#ifndef __drone_controller__Initialization__INTERFACE__
#define __drone_controller__Initialization__INTERFACE__
enum {
    drone_controller_Initialization_WaitForInit_mid,
    drone_controller_Initialization_mid_max,
};
enum {
    drone_controller_Initialization_WaitForInit_req_arena_size =
    0,
    drone_controller_Initialization_WaitForInit_res_arena_size =
    0,
    drone_controller_Initialization_WaitForInit_req_handles =
    0,
    drone_controller_Initialization_WaitForInit_res_handles =
    0,
    drone_controller_Initialization_WaitForInit_err_handles =
    0,
    drone_controller_Initialization_req_arena_size =
    0,
    drone_controller_Initialization_res_arena_size =
    0,
    drone_controller_Initialization_req_handles =
    0,
    drone_controller_Initialization_res_handles =
    0,
    drone_controller_Initialization_err_handles =
    0,
};
typedef struct __nk_packed drone_controller_Initialization_WaitForInit_req {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_Initialization_WaitForInit_req;
nk_static_assert(sizeof(drone_controller_Initialization_WaitForInit_req) == 24, bad_drone_controller_Initialization_WaitForInit_req_size);
nk_static_assert(nk_offsetof(drone_controller_Initialization_WaitForInit_req, base_) == 0, bad_drone_controller_Initialization_WaitForInit_req_base__offset);
#pragma pack(push, 8) /* drone_controller_Initialization_WaitForInit_res */
typedef struct drone_controller_Initialization_WaitForInit_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_Initialization_WaitForInit_err;
nk_static_assert(sizeof(drone_controller_Initialization_WaitForInit_err) == 24, bad_drone_controller_Initialization_WaitForInit_err_size);
nk_static_assert(nk_offsetof(drone_controller_Initialization_WaitForInit_err, base_) == 0, bad_drone_controller_Initialization_WaitForInit_err_base__offset);
typedef struct drone_controller_Initialization_WaitForInit_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_Initialization_WaitForInit_err err_;
            };
        }
drone_controller_Initialization_WaitForInit_res;
nk_static_assert(sizeof(drone_controller_Initialization_WaitForInit_res) == 32, bad_drone_controller_Initialization_WaitForInit_res_size);
nk_static_assert(nk_offsetof(drone_controller_Initialization_WaitForInit_res, base_) == 0, bad_drone_controller_Initialization_WaitForInit_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_Initialization_WaitForInit_res, success) == 24, bad_drone_controller_Initialization_WaitForInit_res_success_offset);
#pragma pack(pop) /* drone_controller_Initialization_WaitForInit_res */
#ifdef NK_USE_UNQUALIFIED_NAMES
#define Initialization_WaitForInit_mid drone_controller_Initialization_WaitForInit_mid
#define Initialization_mid_max drone_controller_Initialization_mid_max
#define Initialization_WaitForInit_req_arena_size drone_controller_Initialization_WaitForInit_req_arena_size
#define Initialization_WaitForInit_res_arena_size drone_controller_Initialization_WaitForInit_res_arena_size
#define Initialization_WaitForInit_req_handles drone_controller_Initialization_WaitForInit_req_handles
#define Initialization_WaitForInit_res_handles drone_controller_Initialization_WaitForInit_res_handles
#define Initialization_WaitForInit_err_handles drone_controller_Initialization_WaitForInit_err_handles
#define Initialization_req_arena_size drone_controller_Initialization_req_arena_size
#define Initialization_res_arena_size drone_controller_Initialization_res_arena_size
#define Initialization_req_handles drone_controller_Initialization_req_handles
#define Initialization_res_handles drone_controller_Initialization_res_handles
#define Initialization_err_handles drone_controller_Initialization_err_handles
#define Initialization_WaitForInit_req drone_controller_Initialization_WaitForInit_req
#define Initialization_WaitForInit_res drone_controller_Initialization_WaitForInit_res
#endif /* NK_USE_UNQUALIFIED_NAMES */

#endif /* __drone_controller__Initialization__INTERFACE__ */

#ifndef __drone_controller__LoggerInterface__INTERFACE__
#define __drone_controller__LoggerInterface__INTERFACE__
enum {
    drone_controller_LoggerInterface_Log_mid,
    drone_controller_LoggerInterface_mid_max,
};
enum {
    drone_controller_LoggerInterface_Log_req_logEntry_size =
    1025,
    drone_controller_LoggerInterface_Log_req_arena_size =
    1025,
    drone_controller_LoggerInterface_Log_res_arena_size =
    0,
    drone_controller_LoggerInterface_Log_req_handles =
    0,
    drone_controller_LoggerInterface_Log_res_handles =
    0,
    drone_controller_LoggerInterface_Log_err_handles =
    0,
    drone_controller_LoggerInterface_req_arena_size =
    1025,
    drone_controller_LoggerInterface_res_arena_size =
    0,
    drone_controller_LoggerInterface_req_handles =
    0,
    drone_controller_LoggerInterface_res_handles =
    0,
    drone_controller_LoggerInterface_err_handles =
    0,
};
typedef struct __nk_packed drone_controller_LoggerInterface_Log_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(4) nk_ptr_t logEntry;
            __nk_alignas(1) nk_uint8_t logLevel;
        }
drone_controller_LoggerInterface_Log_req;
nk_static_assert(sizeof(drone_controller_LoggerInterface_Log_req) == 40, bad_drone_controller_LoggerInterface_Log_req_size);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_req, base_) == 0, bad_drone_controller_LoggerInterface_Log_req_base__offset);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_req, logEntry) == 24, bad_drone_controller_LoggerInterface_Log_req_logEntry_offset);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_req, logLevel) == 32, bad_drone_controller_LoggerInterface_Log_req_logLevel_offset);
#pragma pack(push, 8) /* drone_controller_LoggerInterface_Log_res */
typedef struct drone_controller_LoggerInterface_Log_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_LoggerInterface_Log_err;
nk_static_assert(sizeof(drone_controller_LoggerInterface_Log_err) == 24, bad_drone_controller_LoggerInterface_Log_err_size);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_err, base_) == 0, bad_drone_controller_LoggerInterface_Log_err_base__offset);
typedef struct drone_controller_LoggerInterface_Log_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_LoggerInterface_Log_err err_;
            };
        }
drone_controller_LoggerInterface_Log_res;
nk_static_assert(sizeof(drone_controller_LoggerInterface_Log_res) == 32, bad_drone_controller_LoggerInterface_Log_res_size);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_res, base_) == 0, bad_drone_controller_LoggerInterface_Log_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_LoggerInterface_Log_res, success) == 24, bad_drone_controller_LoggerInterface_Log_res_success_offset);
#pragma pack(pop) /* drone_controller_LoggerInterface_Log_res */
#ifdef NK_USE_UNQUALIFIED_NAMES
#define LoggerInterface_Log_mid drone_controller_LoggerInterface_Log_mid
#define LoggerInterface_mid_max drone_controller_LoggerInterface_mid_max
#define LoggerInterface_Log_req_logEntry_size drone_controller_LoggerInterface_Log_req_logEntry_size
#define LoggerInterface_Log_req_arena_size drone_controller_LoggerInterface_Log_req_arena_size
#define LoggerInterface_Log_res_arena_size drone_controller_LoggerInterface_Log_res_arena_size
#define LoggerInterface_Log_req_handles drone_controller_LoggerInterface_Log_req_handles
#define LoggerInterface_Log_res_handles drone_controller_LoggerInterface_Log_res_handles
#define LoggerInterface_Log_err_handles drone_controller_LoggerInterface_Log_err_handles
