#pragma GCC diagnostic push
/**
 * This file was automatically generated by nk-gen-c.
 * The following copyright applies to the portions of nk-gen-c located in this file:
 * (C) 2024 AO Kaspersky Lab. All Rights Reserved.
 */

#include <nk/transport.h>
#include <nk/types.h>
#include <nk/layout.h>
#ifndef __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
#define __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
nk_static_assert(__NK_SIZEOF_NK_HANDLE_DESC_T == 16, __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
nk_static_assert(__NK_ALIGNOF_NK_HANDLE_DESC_T == 8, __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
#define __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
nk_static_assert(__NK_SIZEOF_NK_PTR_T == 8, __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
#define __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
nk_static_assert(__NK_ALIGNOF_NK_PTR_T == 4, __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
#define __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
nk_static_assert(__NK_SIZEOF_NK_MESSAGE == 24, __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
nk_static_assert(__NK_ALIGNOF_NK_MESSAGE == 8, __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
#define __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
nk_static_assert(__NK_MESSAGE_SIZE_MAX == 8388607, __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
#define __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
nk_static_assert(__NK_MESSAGE_HANDLES_MAX == 255, __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255_FAIL);
#endif
#ifndef __NK_ASSERT___NK_IID_MAX_IS_65535
#define __NK_ASSERT___NK_IID_MAX_IS_65535
nk_static_assert(__NK_IID_MAX == 65535, __NK_ASSERT___NK_IID_MAX_IS_65535_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MID_MAX_IS_65535
#define __NK_ASSERT___NK_MID_MAX_IS_65535
nk_static_assert(__NK_MID_MAX == 65535, __NK_ASSERT___NK_MID_MAX_IS_65535_FAIL);
#endif

#ifndef __NK_GEN_CPP_MANGLE
#  ifdef __cplusplus
#    define __NK_GEN_CPP_MANGLE(name) name ## _
#  else
#    define __NK_GEN_CPP_MANGLE(name) name
#  endif
#endif

#ifdef __cplusplus
    extern "C" {
#endif

#ifndef ____nk_ptr_t__NKTYPE__
#define ____nk_ptr_t__NKTYPE__
nk_static_assert(sizeof(nk_ptr_t) == 8, bad_nk_ptr_t_size);
nk_static_assert(nk_alignof(nk_ptr_t) == 4, bad_nk_ptr_t_align);

#endif /* ____nk_ptr_t__NKTYPE__ */

#ifndef ____UInt16__RAWTYPE__
#define ____UInt16__RAWTYPE__
nk_static_assert(sizeof(nk_uint16_t) == 2, bad_nk_uint16_t_size);
nk_static_assert(nk_alignof(nk_uint16_t) == 2, bad_nk_uint16_t_align);

#endif /* ____UInt16__RAWTYPE__ */

#ifndef ____UInt32__RAWTYPE__
#define ____UInt32__RAWTYPE__
nk_static_assert(sizeof(nk_uint32_t) == 4, bad_nk_uint32_t_size);
nk_static_assert(nk_alignof(nk_uint32_t) == 4, bad_nk_uint32_t_align);

#endif /* ____UInt32__RAWTYPE__ */

#ifndef ____UInt64__RAWTYPE__
#define ____UInt64__RAWTYPE__
nk_static_assert(sizeof(nk_uint64_t) == 8, bad_nk_uint64_t_size);
nk_static_assert(nk_alignof(nk_uint64_t) == 8, bad_nk_uint64_t_align);

#endif /* ____UInt64__RAWTYPE__ */

#ifndef ____UInt8__RAWTYPE__
#define ____UInt8__RAWTYPE__
nk_static_assert(sizeof(nk_uint8_t) == 1, bad_nk_uint8_t_size);
nk_static_assert(nk_alignof(nk_uint8_t) == 1, bad_nk_uint8_t_align);

#endif /* ____UInt8__RAWTYPE__ */

#ifndef __kl_KlogStorage__Entry__STRUCT__
#define __kl_KlogStorage__Entry__STRUCT__
typedef struct __nk_packed kl_KlogStorage_Entry {
            __nk_alignas(8) nk_uint64_t id;
            __nk_alignas(8) nk_uint64_t timestamp;
            __nk_alignas(4) nk_uint32_t source;
            __nk_alignas(4) nk_uint32_t threadId;
            __nk_alignas(4) nk_uint32_t reason;
            __nk_alignas(1) nk_uint8_t msg[4096];
        } kl_KlogStorage_Entry;
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, id) == 0, bad_kl_KlogStorage_Entry_id_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, timestamp) == 8, bad_kl_KlogStorage_Entry_timestamp_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, source) == 16, bad_kl_KlogStorage_Entry_source_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, threadId) == 20, bad_kl_KlogStorage_Entry_threadId_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, reason) == 24, bad_kl_KlogStorage_Entry_reason_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, msg) == 28, bad_kl_KlogStorage_Entry_msg_offset);
nk_static_assert(sizeof(struct kl_KlogStorage_Entry) == 4128, bad_kl_KlogStorage_Entry_size);
#ifdef NK_USE_UNQUALIFIED_NAMES
#define KlogStorage_Entry kl_KlogStorage_Entry
#endif /* NK_USE_UNQUALIFIED_NAMES */

#endif /* __kl_KlogStorage__Entry__STRUCT__ */

#ifndef __kl__KlogStorage__INTERFACE__
#define __kl__KlogStorage__INTERFACE__
enum {
    kl_KlogStorage_write_mid,
    kl_KlogStorage_read_mid,
    kl_KlogStorage_readRange_mid,
    kl_KlogStorage_mid_max,
};
enum {
    kl_KlogStorage_write_req_entry_size = 32,
    kl_KlogStorage_write_req_entry_elem_msg_size =
    4096,
    kl_KlogStorage_write_req_arena_size = 132096,
    kl_KlogStorage_write_res_arena_size = 0,
    kl_KlogStorage_write_req_handles = 0,
    kl_KlogStorage_write_res_handles = 0,
    kl_KlogStorage_write_err_handles = 0,
    kl_KlogStorage_read_res_entries_size = 32,
    kl_KlogStorage_read_res_entries_elem_msg_size =
    4096,
    kl_KlogStorage_read_req_arena_size = 0,
    kl_KlogStorage_read_res_arena_size = 132096,
    kl_KlogStorage_read_req_handles = 0,
    kl_KlogStorage_read_res_handles = 0,
    kl_KlogStorage_read_err_handles = 0,
    kl_KlogStorage_readRange_res_entries_size =
    32,
    kl_KlogStorage_readRange_res_entries_elem_msg_size =
    4096,
    kl_KlogStorage_readRange_req_arena_size = 0,
    kl_KlogStorage_readRange_res_arena_size =
    132096,
    kl_KlogStorage_readRange_req_handles = 0,
    kl_KlogStorage_readRange_res_handles = 0,
    kl_KlogStorage_readRange_err_handles = 0,
    kl_KlogStorage_req_arena_size = 132096,
    kl_KlogStorage_res_arena_size = 132096,
    kl_KlogStorage_req_handles = 0,
    kl_KlogStorage_res_handles = 0,
    kl_KlogStorage_err_handles = 0,
};
typedef struct __nk_packed kl_KlogStorage_write_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(4) nk_ptr_t entry;
        } kl_KlogStorage_write_req;
nk_static_assert(sizeof(kl_KlogStorage_write_req) == 32, bad_kl_KlogStorage_write_req_size);
nk_static_assert(nk_offsetof(kl_KlogStorage_write_req, base_) == 0, bad_kl_KlogStorage_write_req_base__offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_write_req, entry) == 24, bad_kl_KlogStorage_write_req_entry_offset);
#pragma pack(push, 8) /* kl_KlogStorage_write_res */
typedef struct kl_KlogStorage_write_err {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(2) nk_uint16_t status;
        } kl_KlogStorage_write_err;
nk_static_assert(sizeof(kl_KlogStorage_write_err) == 32, bad_kl_KlogStorage_write_err_size);
nk_static_assert(nk_offsetof(kl_KlogStorage_write_err, base_) == 0, bad_kl_KlogStorage_write_err_base__offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_write_err, status) == 24, bad_kl_KlogStorage_write_err_status_offset);
typedef struct kl_KlogStorage_write_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                } res_;
                struct kl_KlogStorage_write_err err_;
            };
        } kl_KlogStorage_write_res;
nk_static_assert(sizeof(kl_KlogStorage_write_res) == 32, bad_kl_KlogStorage_write_res_size);
nk_static_assert(nk_offsetof(kl_KlogStorage_write_res, base_) == 0, bad_kl_KlogStorage_write_res_base__offset);
#pragma pack(pop) /* kl_KlogStorage_write_res */
typedef struct __nk_packed kl_KlogStorage_read_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(4)
            nk_uint32_t numEntries;
        } kl_KlogStorage_read_req;
nk_static_assert(sizeof(kl_KlogStorage_read_req) == 32, bad_kl_KlogStorage_read_req_size);
nk_static_assert(nk_offsetof(kl_KlogStorage_read_req, base_) == 0, bad_kl_KlogStorage_read_req_base__offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_read_req, numEntries) == 24, bad_kl_KlogStorage_read_req_numEntries_offset);
#pragma pack(push, 8) /* kl_KlogStorage_read_res */
typedef struct kl_KlogStorage_read_err {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(2) nk_uint16_t status;
        } kl_KlogStorage_read_err;
nk_static_assert(sizeof(kl_KlogStorage_read_err) == 32, bad_kl_KlogStorage_read_err_size);
nk_static_assert(nk_offsetof(kl_KlogStorage_read_err, base_) == 0, bad_kl_KlogStorage_read_err_base__offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_read_err, status) == 24, bad_kl_KlogStorage_read_err_status_offset);
typedef struct kl_KlogStorage_read_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(4)
                    nk_uint32_t count;
                    __nk_alignas(4)
                    nk_ptr_t entries;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(4)
                    nk_uint32_t count;
                    __nk_alignas(4)
                    nk_ptr_t entries;
                } res_;
                struct kl_KlogStorage_read_err err_;
            };
        } kl_KlogStorage_read_res;
nk_static_assert(sizeof(kl_KlogStorage_read_res) == 40, bad_kl_KlogStorage_read_res_size);
nk_static_assert(nk_offsetof(kl_KlogStorage_read_res, base_) == 0, bad_kl_KlogStorage_read_res_base__offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_read_res, count) == 24, bad_kl_KlogStorage_read_res_count_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_read_res, entries) == 28, bad_kl_KlogStorage_read_res_entries_offset);
#pragma pack(pop) /* kl_KlogStorage_read_res */
typedef struct __nk_packed kl_KlogStorage_readRange_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(8) nk_uint64_t firstId;
            __nk_alignas(8) nk_uint64_t lastId;
        } kl_KlogStorage_readRange_req;
nk_static_assert(sizeof(kl_KlogStorage_readRange_req) == 40, bad_kl_KlogStorage_readRange_req_size);
nk_static_assert(nk_offsetof(kl_KlogStorage_readRange_req, base_) == 0, bad_kl_KlogStorage_readRange_req_base__offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_readRange_req, firstId) == 24, bad_kl_KlogStorage_readRange_req_firstId_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_readRange_req, lastId) == 32, bad_kl_KlogStorage_readRange_req_lastId_offset);
#pragma pack(push, 8) /* kl_KlogStorage_readRange_res */
typedef struct kl_KlogStorage_readRange_err {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(2) nk_uint16_t status;
        } kl_KlogStorage_readRange_err;
nk_static_assert(sizeof(kl_KlogStorage_readRange_err) == 32, bad_kl_KlogStorage_readRange_err_size);
nk_static_assert(nk_offsetof(kl_KlogStorage_readRange_err, base_) == 0, bad_kl_KlogStorage_readRange_err_base__offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_readRange_err, status) == 24, bad_kl_KlogStorage_readRange_err_status_offset);
typedef struct kl_KlogStorage_readRange_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(4)
                    nk_uint32_t count;
                    __nk_alignas(4)
                    nk_ptr_t entries;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(4)
                    nk_uint32_t count;
                    __nk_alignas(4)
                    nk_ptr_t entries;
                } res_;
                struct kl_KlogStorage_readRange_err err_;
            };
        } kl_KlogStorage_readRange_res;
nk_static_assert(sizeof(kl_KlogStorage_readRange_res) == 40, bad_kl_KlogStorage_readRange_res_size);
nk_static_assert(nk_offsetof(kl_KlogStorage_readRange_res, base_) == 0, bad_kl_KlogStorage_readRange_res_base__offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_readRange_res, count) == 24, bad_kl_KlogStorage_readRange_res_count_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_readRange_res, entries) == 28, bad_kl_KlogStorage_readRange_res_entries_offset);
#pragma pack(pop) /* kl_KlogStorage_readRange_res */
#ifdef NK_USE_UNQUALIFIED_NAMES
#define KlogStorage_write_mid kl_KlogStorage_write_mid
#define KlogStorage_read_mid kl_KlogStorage_read_mid
#define KlogStorage_readRange_mid kl_KlogStorage_readRange_mid
#define KlogStorage_mid_max kl_KlogStorage_mid_max
#define KlogStorage_write_req_entry_size kl_KlogStorage_write_req_entry_size
#define KlogStorage_write_req_entry_elem_msg_size kl_KlogStorage_write_req_entry_elem_msg_size
#define KlogStorage_write_req_arena_size kl_KlogStorage_write_req_arena_size
#define KlogStorage_write_res_arena_size kl_KlogStorage_write_res_arena_size
#define KlogStorage_write_req_handles kl_KlogStorage_write_req_handles
#define KlogStorage_write_res_handles kl_KlogStorage_write_res_handles
#define KlogStorage_write_err_handles kl_KlogStorage_write_err_handles
