#pragma GCC diagnostic push
/**
 * This file was automatically generated by nk-gen-c.
 * The following copyright applies to the portions of nk-gen-c located in this file:
 * (C) 2024 AO Kaspersky Lab. All Rights Reserved.
 */

#include <nk/transport.h>
#include <nk/types.h>
#include <nk/layout.h>
#ifndef __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
#define __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16
nk_static_assert(__NK_SIZEOF_NK_HANDLE_DESC_T == 16, __NK_ASSERT___NK_SIZEOF_NK_HANDLE_DESC_T_IS_16_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8
nk_static_assert(__NK_ALIGNOF_NK_HANDLE_DESC_T == 8, __NK_ASSERT___NK_ALIGNOF_NK_HANDLE_DESC_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
#define __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8
nk_static_assert(__NK_SIZEOF_NK_PTR_T == 8, __NK_ASSERT___NK_SIZEOF_NK_PTR_T_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
#define __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4
nk_static_assert(__NK_ALIGNOF_NK_PTR_T == 4, __NK_ASSERT___NK_ALIGNOF_NK_PTR_T_IS_4_FAIL);
#endif
#ifndef __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
#define __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24
nk_static_assert(__NK_SIZEOF_NK_MESSAGE == 24, __NK_ASSERT___NK_SIZEOF_NK_MESSAGE_IS_24_FAIL);
#endif
#ifndef __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
#define __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8
nk_static_assert(__NK_ALIGNOF_NK_MESSAGE == 8, __NK_ASSERT___NK_ALIGNOF_NK_MESSAGE_IS_8_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
#define __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607
nk_static_assert(__NK_MESSAGE_SIZE_MAX == 8388607, __NK_ASSERT___NK_MESSAGE_SIZE_MAX_IS_8388607_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
#define __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255
nk_static_assert(__NK_MESSAGE_HANDLES_MAX == 255, __NK_ASSERT___NK_MESSAGE_HANDLES_MAX_IS_255_FAIL);
#endif
#ifndef __NK_ASSERT___NK_IID_MAX_IS_65535
#define __NK_ASSERT___NK_IID_MAX_IS_65535
nk_static_assert(__NK_IID_MAX == 65535, __NK_ASSERT___NK_IID_MAX_IS_65535_FAIL);
#endif
#ifndef __NK_ASSERT___NK_MID_MAX_IS_65535
#define __NK_ASSERT___NK_MID_MAX_IS_65535
nk_static_assert(__NK_MID_MAX == 65535, __NK_ASSERT___NK_MID_MAX_IS_65535_FAIL);
#endif

#ifndef __NK_GEN_CPP_MANGLE
#  ifdef __cplusplus
#    define __NK_GEN_CPP_MANGLE(name) name ## _
#  else
#    define __NK_GEN_CPP_MANGLE(name) name
#  endif
#endif

#ifdef __cplusplus
    extern "C" {
#endif

#ifndef ____UInt8__RAWTYPE__
#define ____UInt8__RAWTYPE__
nk_static_assert(sizeof(nk_uint8_t) == 1, bad_nk_uint8_t_size);
nk_static_assert(nk_alignof(nk_uint8_t) == 1, bad_nk_uint8_t_align);

#endif /* ____UInt8__RAWTYPE__ */

#ifndef __drone_controller__PeripheryControllerInterface__INTERFACE__
#define __drone_controller__PeripheryControllerInterface__INTERFACE__
enum {
    drone_controller_PeripheryControllerInterface_EnableBuzzer_mid,
    drone_controller_PeripheryControllerInterface_SetKillSwitch_mid,
    drone_controller_PeripheryControllerInterface_SetCargoLock_mid,
    drone_controller_PeripheryControllerInterface_mid_max,
};
enum {
    drone_controller_PeripheryControllerInterface_EnableBuzzer_req_arena_size =
    0,
    drone_controller_PeripheryControllerInterface_EnableBuzzer_res_arena_size =
    0,
    drone_controller_PeripheryControllerInterface_EnableBuzzer_req_handles =
    0,
    drone_controller_PeripheryControllerInterface_EnableBuzzer_res_handles =
    0,
    drone_controller_PeripheryControllerInterface_EnableBuzzer_err_handles =
    0,
    drone_controller_PeripheryControllerInterface_SetKillSwitch_req_arena_size =
    0,
    drone_controller_PeripheryControllerInterface_SetKillSwitch_res_arena_size =
    0,
    drone_controller_PeripheryControllerInterface_SetKillSwitch_req_handles =
    0,
    drone_controller_PeripheryControllerInterface_SetKillSwitch_res_handles =
    0,
    drone_controller_PeripheryControllerInterface_SetKillSwitch_err_handles =
    0,
    drone_controller_PeripheryControllerInterface_SetCargoLock_req_arena_size =
    0,
    drone_controller_PeripheryControllerInterface_SetCargoLock_res_arena_size =
    0,
    drone_controller_PeripheryControllerInterface_SetCargoLock_req_handles =
    0,
    drone_controller_PeripheryControllerInterface_SetCargoLock_res_handles =
    0,
    drone_controller_PeripheryControllerInterface_SetCargoLock_err_handles =
    0,
    drone_controller_PeripheryControllerInterface_req_arena_size =
    0,
    drone_controller_PeripheryControllerInterface_res_arena_size =
    0,
    drone_controller_PeripheryControllerInterface_req_handles =
    0,
    drone_controller_PeripheryControllerInterface_res_handles =
    0,
    drone_controller_PeripheryControllerInterface_err_handles =
    0,
};
typedef struct __nk_packed drone_controller_PeripheryControllerInterface_EnableBuzzer_req {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_PeripheryControllerInterface_EnableBuzzer_req;
nk_static_assert(sizeof(drone_controller_PeripheryControllerInterface_EnableBuzzer_req) == 24, bad_drone_controller_PeripheryControllerInterface_EnableBuzzer_req_size);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_EnableBuzzer_req, base_) == 0, bad_drone_controller_PeripheryControllerInterface_EnableBuzzer_req_base__offset);
#pragma pack(push, 8) /* drone_controller_PeripheryControllerInterface_EnableBuzzer_res */
typedef struct drone_controller_PeripheryControllerInterface_EnableBuzzer_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_PeripheryControllerInterface_EnableBuzzer_err;
nk_static_assert(sizeof(drone_controller_PeripheryControllerInterface_EnableBuzzer_err) == 24, bad_drone_controller_PeripheryControllerInterface_EnableBuzzer_err_size);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_EnableBuzzer_err, base_) == 0, bad_drone_controller_PeripheryControllerInterface_EnableBuzzer_err_base__offset);
typedef struct drone_controller_PeripheryControllerInterface_EnableBuzzer_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_PeripheryControllerInterface_EnableBuzzer_err err_;
            };
        }
drone_controller_PeripheryControllerInterface_EnableBuzzer_res;
nk_static_assert(sizeof(drone_controller_PeripheryControllerInterface_EnableBuzzer_res) == 32, bad_drone_controller_PeripheryControllerInterface_EnableBuzzer_res_size);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_EnableBuzzer_res, base_) == 0, bad_drone_controller_PeripheryControllerInterface_EnableBuzzer_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_EnableBuzzer_res, success) == 24, bad_drone_controller_PeripheryControllerInterface_EnableBuzzer_res_success_offset);
#pragma pack(pop) /* drone_controller_PeripheryControllerInterface_EnableBuzzer_res */
typedef struct __nk_packed drone_controller_PeripheryControllerInterface_SetKillSwitch_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(1) nk_uint8_t enable;
        }
drone_controller_PeripheryControllerInterface_SetKillSwitch_req;
nk_static_assert(sizeof(drone_controller_PeripheryControllerInterface_SetKillSwitch_req) == 32, bad_drone_controller_PeripheryControllerInterface_SetKillSwitch_req_size);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_SetKillSwitch_req, base_) == 0, bad_drone_controller_PeripheryControllerInterface_SetKillSwitch_req_base__offset);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_SetKillSwitch_req, enable) == 24, bad_drone_controller_PeripheryControllerInterface_SetKillSwitch_req_enable_offset);
#pragma pack(push, 8) /* drone_controller_PeripheryControllerInterface_SetKillSwitch_res */
typedef struct drone_controller_PeripheryControllerInterface_SetKillSwitch_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_PeripheryControllerInterface_SetKillSwitch_err;
nk_static_assert(sizeof(drone_controller_PeripheryControllerInterface_SetKillSwitch_err) == 24, bad_drone_controller_PeripheryControllerInterface_SetKillSwitch_err_size);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_SetKillSwitch_err, base_) == 0, bad_drone_controller_PeripheryControllerInterface_SetKillSwitch_err_base__offset);
typedef struct drone_controller_PeripheryControllerInterface_SetKillSwitch_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_PeripheryControllerInterface_SetKillSwitch_err err_;
            };
        }
drone_controller_PeripheryControllerInterface_SetKillSwitch_res;
nk_static_assert(sizeof(drone_controller_PeripheryControllerInterface_SetKillSwitch_res) == 32, bad_drone_controller_PeripheryControllerInterface_SetKillSwitch_res_size);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_SetKillSwitch_res, base_) == 0, bad_drone_controller_PeripheryControllerInterface_SetKillSwitch_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_SetKillSwitch_res, success) == 24, bad_drone_controller_PeripheryControllerInterface_SetKillSwitch_res_success_offset);
#pragma pack(pop) /* drone_controller_PeripheryControllerInterface_SetKillSwitch_res */
typedef struct __nk_packed drone_controller_PeripheryControllerInterface_SetCargoLock_req {
            __nk_alignas(8)
            struct nk_message base_;
            __nk_alignas(1) nk_uint8_t enable;
        }
drone_controller_PeripheryControllerInterface_SetCargoLock_req;
nk_static_assert(sizeof(drone_controller_PeripheryControllerInterface_SetCargoLock_req) == 32, bad_drone_controller_PeripheryControllerInterface_SetCargoLock_req_size);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_SetCargoLock_req, base_) == 0, bad_drone_controller_PeripheryControllerInterface_SetCargoLock_req_base__offset);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_SetCargoLock_req, enable) == 24, bad_drone_controller_PeripheryControllerInterface_SetCargoLock_req_enable_offset);
#pragma pack(push, 8) /* drone_controller_PeripheryControllerInterface_SetCargoLock_res */
typedef struct drone_controller_PeripheryControllerInterface_SetCargoLock_err {
            __nk_alignas(8)
            struct nk_message base_;
        }
drone_controller_PeripheryControllerInterface_SetCargoLock_err;
nk_static_assert(sizeof(drone_controller_PeripheryControllerInterface_SetCargoLock_err) == 24, bad_drone_controller_PeripheryControllerInterface_SetCargoLock_err_size);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_SetCargoLock_err, base_) == 0, bad_drone_controller_PeripheryControllerInterface_SetCargoLock_err_base__offset);
typedef struct drone_controller_PeripheryControllerInterface_SetCargoLock_res {
            union {
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                };
                struct {
                    __nk_alignas(8)
                    struct nk_message base_;
                    __nk_alignas(1)
                    nk_uint8_t success;
                } res_;
                struct drone_controller_PeripheryControllerInterface_SetCargoLock_err err_;
            };
        }
drone_controller_PeripheryControllerInterface_SetCargoLock_res;
nk_static_assert(sizeof(drone_controller_PeripheryControllerInterface_SetCargoLock_res) == 32, bad_drone_controller_PeripheryControllerInterface_SetCargoLock_res_size);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_SetCargoLock_res, base_) == 0, bad_drone_controller_PeripheryControllerInterface_SetCargoLock_res_base__offset);
nk_static_assert(nk_offsetof(drone_controller_PeripheryControllerInterface_SetCargoLock_res, success) == 24, bad_drone_controller_PeripheryControllerInterface_SetCargoLock_res_success_offset);
#pragma pack(pop) /* drone_controller_PeripheryControllerInterface_SetCargoLock_res */
#ifdef NK_USE_UNQUALIFIED_NAMES
#define PeripheryControllerInterface_EnableBuzzer_mid drone_controller_PeripheryControllerInterface_EnableBuzzer_mid
#define PeripheryControllerInterface_SetKillSwitch_mid drone_controller_PeripheryControllerInterface_SetKillSwitch_mid
#define PeripheryControllerInterface_SetCargoLock_mid drone_controller_PeripheryControllerInterface_SetCargoLock_mid
#define PeripheryControllerInterface_mid_max drone_controller_PeripheryControllerInterface_mid_max
#define PeripheryControllerInterface_EnableBuzzer_req_arena_size drone_controller_PeripheryControllerInterface_EnableBuzzer_req_arena_size
